Results/Verifications/S2427/bottleneck-determination/point_select/threads-1/sysbench.log
$ time sysbench --config-file=sysbench.conf --threads=1 oltp_point_select --tables=32 --table-size=1000000 --db-ps-mode=auto --rand-typ
e=uniform run
sysbench 1.0.20 (using system LuaJIT 2.1.1700206165)

Running the test with following options:
Number of threads: 1
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 1 tps: 908.17 qps: 908.17 (r/w/o: 908.17/0.00/0.00) lat (ms,95%): 1.37 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 1 tps: 1041.71 qps: 1041.71 (r/w/o: 1041.71/0.00/0.00) lat (ms,95%): 1.16 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 1 tps: 1027.58 qps: 1027.58 (r/w/o: 1027.58/0.00/0.00) lat (ms,95%): 1.16 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 1 tps: 963.32 qps: 963.32 (r/w/o: 963.32/0.00/0.00) lat (ms,95%): 1.30 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 1 tps: 1017.19 qps: 1017.19 (r/w/o: 1017.19/0.00/0.00) lat (ms,95%): 1.21 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 1 tps: 1014.50 qps: 1014.50 (r/w/o: 1014.50/0.00/0.00) lat (ms,95%): 1.23 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 1 tps: 1042.30 qps: 1042.30 (r/w/o: 1042.30/0.00/0.00) lat (ms,95%): 1.14 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 1 tps: 1043.69 qps: 1043.69 (r/w/o: 1043.69/0.00/0.00) lat (ms,95%): 1.14 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 1 tps: 1047.51 qps: 1047.51 (r/w/o: 1047.51/0.00/0.00) lat (ms,95%): 1.14 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            101635
        write:                           0
        other:                           0
        total:                           101635
    transactions:                        101635 (1016.26 per sec.)
    queries:                             101635 (1016.26 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          100.0054s
    total number of events:              101635

Latency (ms):
         min:                                    0.71
         avg:                                    0.98
         max:                                   13.97
         95th percentile:                        1.21
         sum:                                99879.18

Threads fairness:
    events (avg/stddev):           101635.0000/0.00
    execution time (avg/stddev):   99.8792/0.00


real    1m40.069s
user    0m2.050s
sys     0m3.306s